export const CAR_MAKES = [
  "تويوتا",
  "هيونداي",
  "فورد",
  "مرسيدس بنز",
  "بي إم دبليو",
  "نيسان",
  "كيا",
];

export const CAR_MODELS: { [key: string]: string[] } = {
  "تويوتا": ["كامري", "كورولا", "لاند كروزر", "هايلكس", "راف 4"],
  "هيونداي": ["إلنترا", "سوناتا", "توسان", "سنتافي", "أكسنت"],
  "فورد": ["إكسبلورر", "توروس", "إكسبيديشن", "إف-150"],
  "مرسيدس بنز": ["الفئة C", "الفئة E", "الفئة S", "الفئة G"],
  "بي إم دبليو": ["الفئة 3", "الفئة 5", "الفئة 7", "X5", "X7"],
  "نيسان": ["صني", "باترول", "ألتيما", "ماكسيما"],
  "كيا": ["سيراتو", "أوبتيما", "سبورتاج", "سورينتو"],
};

export const CAR_YEARS = Array.from(
  { length: new Date().getFullYear() - 1989 },
  (_, i) => new Date().getFullYear() - i
);

export const CAR_FEATURES = [
    "فتحة سقف",
    "مقاعد جلد",
    "نظام ملاحة",
    "كاميرا خلفية",
    "بلوتوث",
    "جنوط ألمنيوم",
    "دفع رباعي",
    "مثبت سرعة"
];

export const CLOUDINARY_CLOUD_NAME = "dbm1benv0";
export const CLOUDINARY_UPLOAD_PRESET = "ml_default";
