export const CAR_MAKES = [
  "تويوتا",
  "هيونداي",
  "فورد",
  "مرسيدس بنز",
  "بي إم دبليو",
  "نيسان",
  "كيا",
  "لكزس",
  "شيفروليه",
];

export const CAR_MODELS: { [key: string]: string[] } = {
  "تويوتا": ["كامري", "كورولا", "لاند كروزر", "هايلكس", "راف 4", "يارس", "برادو", "أفالون", "فورتشنر", "شاص", "سيكويا"],
  "هيونداي": ["إلنترا", "سوناتا", "توسان", "سنتافي", "أكسنت", "كريتا", "كونا", "باليسيد", "أزيرا"],
  "فورد": ["إكسبلورر", "توروس", "إكسبيديشن", "إف-150", "موستانج", "إيدج", "رينجر", "برونكو"],
  "مرسيدس بنز": ["الفئة C", "الفئة E", "الفئة S", "الفئة G", "GLE", "GLC", "A-Class", "CLA"],
  "بي إم دبليو": ["الفئة 3", "الفئة 5", "الفئة 7", "X5", "X7", "X3", "X6", "X1"],
  "نيسان": ["صني", "باترول", "ألتيما", "ماكسيما", "كيكس", "إكس-تريل", "نافارا", "أرمادا"],
  "كيا": ["سيراتو", "أوبتيما", "سبورتاج", "سورينتو", "ريو", "بيكانتو", "تيلورايد", "ستينجر"],
  "لكزس": ["ES", "LS", "LX", "RX", "GX", "IS"],
  "شيفروليه": ["تاهو", "سوبربان", "سيلفرادو", "كامارو", "ماليبو", "إمبالا", "ترافيرس"],
};

export const YEMENI_GOVERNORATES = ["أمانة العاصمة", "صنعاء", "عدن", "تعز", "الحديدة", "إب", "حضرموت", "ذمار", "المحويت", "عمران", "صعدة", "الجوف", "مأرب", "البيضاء", "شبوة", "أبين", "المهرة", "ريمة", "أرخبيل سقطرى", "الضالع", "حجة"];


export const CAR_YEARS = Array.from(
  { length: new Date().getFullYear() - 1989 },
  (_, i) => new Date().getFullYear() - i
);

export const CAR_FEATURES = [
    "فتحة سقف",
    "مقاعد جلد",
    "نظام ملاحة",
    "كاميرا خلفية",
    "بلوتوث",
    "جنوط ألمنيوم",
    "دفع رباعي",
    "مثبت سرعة"
];

export const CLOUDINARY_CLOUD_NAME = "dbm1benv0";
export const CLOUDINARY_UPLOAD_PRESET = "ml_default";
